# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Command-line tool for Pieces.app
brew "pieces-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Rsync for cloud storage
brew "rclone"
# SOcket CAT: netcat on steroids
brew "socat"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Control computers fast and securely from anywhere
cask "jollysfastvnc"
# Offline, open-source, document manager with tagging support
cask "tagspaces"
mas "Magnet", id: 441258766
mas "Perplexity", id: 6714467650
